{
  "_class_name": "CausalWanModel",
  "_diffusers_version": "0.33.0",
  "model_type": "ti2v",
  "patch_size": [1, 2, 2],
  "text_len": 512,
  "text_dim": 4096,
  "in_dim": 48,
  "dim": 3072,
  "ffn_dim": 14336,
  "freq_dim": 256,
  "out_dim": 48,
  "num_heads": 24,
  "num_layers": 30,
  "local_attn_size": 12,
  "sink_size": 3,
  "qk_norm": true,
  "cross_attn_norm": true,
  "eps": 1e-06,
  "add_control_adapter": true,
  "in_dim_control_adapter": 24,
  "downscale_factor_control_adapter": 16,
  "add_ref_conv": false,
  "cam_method": "prope",
  "attn_compress": 4,
  "cam_self_attn_layers": [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29]
}
